import numpy
# 1 Ввести три числа m, n, p. Подсчитать количество отрицательных чисел.
a=int(input("Введите 3 ч")
for x in range(3):
    if
     = 2 ** x
    print(y)

# 2 Определить, имеется ли среди трёх чисел a, b и c хотя бы одна пара равных между собой чисел.



# 3 Даны три числа a, b и c. Найти среднее геометрическое этих чисел, если все они отличны от нуля, и среднее арифметическое в противном случае.
# 4 По номеру месяца напечатать пору года.
# 5 Определить, есть ли среди заданных целых чисел A, B, C, D хотя бы одно нечётное.
# 6 Дано натуральное трехзначное число n. Верно ли, что среди его цифр есть 0 или 9?
# 7 В переменную Y ввести номер года. Определить, является ли год високосным.
# 8 Дано натуральное четырехзначное число n. Верно ли, что все его цифры различны?
# 9 Проверить, является ли дробь A / B правильной.



#10 Число делится на 3 тогда, когда сумма его цифр делится на 3.
# Проверить этот признак на примере заданного трехзначного числа.

a=369
if a%3==0:
    print(f"{a} делится на 3 без остатка")
else:
    print(f"{a} не делится на 3 без остатка")
x = list(str(a))

if (int(x[0])+int(x[1])+int(x[2]))%3==0:
    print(f"сумма чисел делится на 3 без остатка")

    # 13 Для целого числа К от 1 до 9 напечатать фразу «мне К лет»,

print(f"{a} не делится на 3 без остатка")
a=input()
